cap-1-tickets/app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets"
---
  def index
    @tickets = Ticket.all

INSERT INTO "tickets" ("name", "seat_id_seq", "address", "price_paid", "email_address", "created_at", "updated_at", "phone") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save

UPDATE "tickets" SET "updated_at" = ?, "phone" = ? WHERE "tickets"."id" = ?  [["updated_at", "2025-01-06 16:56:41.331867"], ["phone", "83 999999999"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @ticket.update(ticket_params)

DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 3]]
---
  def destroy
    @ticket.destroy!

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_ticket
      @ticket = Ticket.find(params[:id])